FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    #if ipconfigIS_DISABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
        #warning "Consider enabling ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES for NetworkInterface"
    #endif

#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
    #if !defined( niEMAC_STM32HX )
        #error "ipconfigETHERNET_DRIVER_FILTERS_PACKETS requires STM32H5/H7 (hardware L3/L4 filters)"
    #endif
    #if ipconfigIS_DISABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
        #error "ipconfigETHERNET_DRIVER_FILTERS_PACKETS requires ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM"
    #endif
    #if ipconfigIS_DISABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
        #error "ipconfigETHERNET_DRIVER_FILTERS_PACKETS requires ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES (L3 destination filtering)"
    #endif
#endif

    #if ipconfigIS_DISABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        #warning "Consider enabling ipconfigUSE_LINKED_RX_MESSAGES for NetworkInterface"
    #endif

#endif /* if ipconfigIS_DISABLED( ipconfigPORT_SUPPRESS_WARNING ) */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            Macros & Definitions                           */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if ( defined( __MPU_PRESENT ) && ( __MPU_PRESENT == 1U ) )
    #define niEMAC_MPU
    #define niEMAC_MPU_ENABLED    ( _FLD2VAL( MPU_CTRL_ENABLE, MPU->CTRL ) != 0 )
#endif

#if ( defined( __DCACHE_PRESENT ) && ( __DCACHE_PRESENT == 1U ) )
    #define niEMAC_CACHEABLE
    #define niEMAC_CACHE_ENABLED         ( _FLD2VAL( SCB_CCR_DC, SCB->CCR ) != 0 )
    #define niEMAC_CACHE_MAINTENANCE     ( ipconfigIS_DISABLED( niEMAC_USE_MPU ) && niEMAC_CACHE_ENABLED )
    #ifdef __SCB_DCACHE_LINE_SIZE
        #define niEMAC_DATA_ALIGNMENT    __SCB_DCACHE_LINE_SIZE
    #else
        #define niEMAC_DATA_ALIGNMENT    32U
    #endif
#else
    #define niEMAC_DATA_ALIGNMENT        portBYTE_ALIGNMENT
#endif

#define niEMAC_DATA_ALIGNMENT_MASK       ( niEMAC_DATA_ALIGNMENT - 1U )
#define niEMAC_BUF_ALIGNMENT             32U
#define niEMAC_BUF_ALIGNMENT_MASK        ( niEMAC_BUF_ALIGNMENT - 1U )

#define niEMAC_DATA_BUFFER_SIZE          ( ( ipTOTAL_ETHERNET_FRAME_SIZE + niEMAC_DATA_ALIGNMENT_MASK ) & ~niEMAC_DATA_ALIGNMENT_MASK )
#define niEMAC_TOTAL_BUFFER_SIZE         ( ( ( niEMAC_DATA_BUFFER_SIZE + ipBUFFER_PADDING ) + niEMAC_BUF_ALIGNMENT_MASK ) & ~niEMAC_BUF_ALIGNMENT_MASK )

#if defined( niEMAC_STM32FX )

    #undef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
    #define ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG    ETH_DMASR_TBUS

    #undef ETH_CTRLPACKETS_BLOCK_ALL
    #define ETH_CTRLPACKETS_BLOCK_ALL    ETH_MACFFR_PCF_BlockAll

    #undef ETH_IP_HEADER_IPV4
    #define ETH_IP_HEADER_IPV4           ETH_DMAPTPRXDESC_IPV4PR

    #undef ETH_IP_HEADER_IPV6
    #define ETH_IP_HEADER_IPV6           ETH_DMAPTPRXDESC_IPV6PR

    #undef ETH_IP_PAYLOAD_UNKNOWN
    #define ETH_IP_PAYLOAD_UNKNOWN       0x0U

    #undef ETH_IP_PAYLOAD_UDP
    #define ETH_IP_PAYLOAD_UDP           ETH_DMAPTPRXDESC_IPPT_UDP

    #undef ETH_IP_PAYLOAD_TCP
    #define ETH_IP_PAYLOAD_TCP           ETH_DMAPTPRXDESC_IPPT_TCP

    #undef ETH_IP_PAYLOAD_ICMPN
    #define ETH_IP_PAYLOAD_ICMPN         ETH_DMAPTPRXDESC_IPPT_ICMP

#elif defined( niEMAC_STM32HX )

    #undef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
    #define ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG    ETH_DMACSR_TBU

    #undef ETH_IP_PAYLOAD_IGMP
    #define ETH_IP_PAYLOAD_IGMP                   0x4U

#endif /* if defined( niEMAC_STM32FX ) */

#define ETH_IP_PAYLOAD_MASK           0x7U

/* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
#define niEMAC_CRC_POLY               0x04C11DB7
#define niEMAC_MAC_IS_MULTICAST( MAC )    ( ( MAC[ 0 ] & 1U ) != 0 )
#define niEMAC_MAC_IS_UNICAST( MAC )      ( ( MAC[ 0 ] & 1U ) == 0 )
#define niEMAC_ADDRESS_HASH_BITS      64U
#define niEMAC_MAC_SRC_MATCH_COUNT    3U

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                               typedefs                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Interrupt events to process: reception, transmission and error handling. */
typedef enum
{
    eMacEventNone = 0,
    eMacEventRx = 1 << 0,
    eMacEventTx = 1 << 1,
    eMacEventErrRx = 1 << 2,
    eMacEventErrTx = 1 << 3,
    eMacEventErrDma = 1 << 4,
    eMacEventErrEth = 1 << 5,
    eMacEventErrMac = 1 << 6,
    eMacEventAll = ( 1 << 7 ) - 1,
} eMAC_IF_EVENT;

typedef enum
{
    eMacEthInit,     /* Must initialise ETH. */
    eMacPhyInit,     /* Must initialise PHY. */
    eMacPhyStart,    /* Must start PHY. */
    eMacTaskStart,   /* Must start deferred interrupt handler task. */
    eMacEthStart,    /* Must start ETH. */
    eMacInitComplete /* Initialisation was successful. */
} eMAC_INIT_STATUS_TYPE;

typedef struct xTxPacketMeta
{
    NetworkBufferDescriptor_t * pxDescriptor;
    UBaseType_t uxDescCount;
    BaseType_t xInUse;
} TxPacketMeta_t;

/* typedef struct xMacSrcMatchData
 * {
 *  uint8_t ucSrcMatchCounters[ niEMAC_MAC_SRC_MATCH_COUNT ];
 *  uint8_t uxMACEntryIndex = 0;
 * } MacSrcMatchData_t;
 *
 * typedef struct xMacHashData
 * {
 *  uint32_t ulHashTable[ niEMAC_ADDRESS_HASH_BITS / 32 ];
 *  uint8_t ucAddrHashCounters[ niEMAC_ADDRESS_HASH_BITS ];
 * } MacHashData_t;
 *
 * typedef struct xMacFilteringData
 * {
 *  MacSrcMatchData_t xSrcMatch;
 *  MacHashData_t xHash;
 * } MacFilteringData_t;
 *
 * typedef struct xEMACData
 * {
 *  ETH_HandleTypeDef xEthHandle;
 *  EthernetPhy_t xPhyObject;
 *  TaskHandle_t xEMACTaskHandle;
 *  SemaphoreHandle_t xTxMutex, xTxDescSem;
 *  ETH_BufferTypeDef xTxBuffers[ niEMAC_BUFS_PER_DESC * ETH_TX_DESC_CNT ];
 *  BaseType_t xSwitchRequired;
 *  eMAC_INIT_STATUS_TYPE xMacInitStatus;
 *  BaseType_t xEMACIndex;
 *  MacFilteringData_t xMacFilteringData;
 * } EMACData_t; */

