FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

#if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_TCP_SEGMENTATION ) && ipconfigIS_ENABLED( ipconfigUSE_TCP )

    static BaseType_t prvSetTCPSegmentationConfig( const NetworkBufferDescriptor_t * pxDescriptor,
                                                   size_t uxTotalLength,
                                                   ETH_TxPacketConfigTypeDef * pxTxConfig )
    {
        if( ( pxDescriptor == NULL ) ||
            ( pxDescriptor->pucEthernetBuffer == NULL ) ||
            ( pxTxConfig == NULL ) ||
            ( pxDescriptor->xDataLength < sizeof( EthernetHeader_t ) ) )
        {
            return pdFALSE;
        }

        const uint8_t * const pucEthernetBuffer = pxDescriptor->pucEthernetBuffer;
        const EthernetHeader_t * const pxEthernetHeader = ( const EthernetHeader_t * const ) pucEthernetBuffer;
        size_t uxHeaderPrefix = 0U;
        size_t uxTCPHeaderLengthBytes = 0U;

        if( pxEthernetHeader->usFrameType == ipIPv4_FRAME_TYPE )
        {
            #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
            {
                if( pxDescriptor->xDataLength < sizeof( IPPacket_t ) )
                {
                    return pdFALSE;
                }

                const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pucEthernetBuffer;

                if( pxIPPacket->xIPHeader.ucProtocol != ipPROTOCOL_TCP )
                {
                    return pdFALSE;
                }

                const size_t uxIPHeaderLength = ( size_t ) ( pxIPPacket->xIPHeader.ucVersionHeaderLength & 0x0FU ) << 2U;

                if( uxIPHeaderLength < ipSIZE_OF_IPv4_HEADER )
                {
                    return pdFALSE;
                }

                uxHeaderPrefix = sizeof( EthernetHeader_t ) + uxIPHeaderLength;
            }
            #else
                return pdFALSE;
            #endif
        }
        else if( pxEthernetHeader->usFrameType == ipIPv6_FRAME_TYPE )
        {
            #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
            {
                if( pxDescriptor->xDataLength < sizeof( IPPacket_IPv6_t ) )
                {
                    return pdFALSE;
                }

                const IPPacket_IPv6_t * const pxIPPacket_IPv6 = ( const IPPacket_IPv6_t * const ) pucEthernetBuffer;

                if( pxIPPacket_IPv6->xIPHeader.ucNextHeader != ipPROTOCOL_TCP )
                {
                    return pdFALSE;
                }

                uxHeaderPrefix = sizeof( EthernetHeader_t ) + ipSIZE_OF_IPv6_HEADER;
            }
            #else
                return pdFALSE;
            #endif
        }
        else
        {
            return pdFALSE;
        }

        if( pxDescriptor->xDataLength < ( uxHeaderPrefix + sizeof( TCPHeader_t ) ) )
        {
            return pdFALSE;
        }

        const TCPHeader_t * const pxTCPHeader = ( const TCPHeader_t * const ) &( pucEthernetBuffer[ uxHeaderPrefix ] );
        uxTCPHeaderLengthBytes = ( size_t ) ( pxTCPHeader->ucTCPOffset & 0xF0U ) >> 2U;

        if( ( uxTCPHeaderLengthBytes < ipSIZE_OF_TCP_HEADER ) ||
            ( uxTCPHeaderLengthBytes > 60U ) ||
            ( ( uxTCPHeaderLengthBytes & 0x03U ) != 0U ) ||
            ( pxDescriptor->xDataLength < ( uxHeaderPrefix + uxTCPHeaderLengthBytes ) ) )
        {
            return pdFALSE;
        }

        const size_t uxPayloadLength = ( uxTotalLength > ( uxHeaderPrefix + uxTCPHeaderLengthBytes ) ) ?
                                       ( uxTotalLength - ( uxHeaderPrefix + uxTCPHeaderLengthBytes ) ) :
                                       0U;

        if( uxPayloadLength <= niEMAC_TCP_SEGMENTATION_MSS )
        {
            return pdFALSE;
        }

        const size_t uxTCPHeaderLengthWords = uxTCPHeaderLengthBytes >> 2U;

        if( ( uxTCPHeaderLengthWords < 5U ) || ( uxTCPHeaderLengthWords > 15U ) )
        {
            return pdFALSE;
        }

        configASSERT( uxPayloadLength <= UINT32_MAX );
        pxTxConfig->Attributes |= ETH_TX_PACKETS_FEATURES_TSO;
        pxTxConfig->MaxSegmentSize = ( uint32_t ) niEMAC_TCP_SEGMENTATION_MSS;
        pxTxConfig->PayloadLen = ( uint32_t ) uxPayloadLength;
        pxTxConfig->TCPHeaderLen = ( uint32_t ) uxTCPHeaderLengthWords;
        return pdTRUE;
    }

#endif /* if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_TCP_SEGMENTATION ) && ipconfigIS_ENABLED( ipconfigUSE_TCP ) */

/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceOutput( NetworkInterface_t * pxInterface,
                                             NetworkBufferDescriptor_t * const pxDescriptor,
                                             BaseType_t xReleaseAfterSend )
{
    BaseType_t xResult = pdFAIL;

    /* Zero-Copy Only */
    configASSERT( xReleaseAfterSend == pdTRUE );

    do
    {
        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

        if( ( pxDescriptor == NULL ) || ( pxDescriptor->pucEthernetBuffer == NULL ) || ( pxDescriptor->xDataLength > niEMAC_DATA_BUFFER_SIZE ) )
        {
            /* Oversized TX frames are not supported in this single-buffer path. */
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Invalid Descriptor\n" ) );
            break;
        }

        if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Link Down\n" ) );
            break;
        }

        if( ( xMacInitStatus != eMacInitComplete ) || ( HAL_ETH_GetState( pxEthHandle ) != HAL_ETH_STATE_STARTED ) )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Interface Not Started\n" ) );
            break;
        }

        ETH_TxPacketConfigTypeDef xTxConfig =
        {
            .CRCPadCtrl = ETH_CRC_PAD_INSERT,
            .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD,
        };

        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
            xTxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
            xTxConfig.Attributes |= ETH_TX_PACKETS_FEATURES_CSUM;
        #else
            xTxConfig.ChecksumCtrl = ETH_CHECKSUM_DISABLE;
        #endif

