FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
        const EthernetHeader_t * const pxEthHeader = ( const EthernetHeader_t * const ) pxDescriptor->pucEthernetBuffer;

        if( pxEthHeader->usFrameType == ipIPv4_FRAME_TYPE )
        {
            #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pxDescriptor->pucEthernetBuffer;

                if( pxIPPacket->xIPHeader.ucProtocol == ipPROTOCOL_ICMP )
                {
                    #if ipconfigIS_ENABLED( ipconfigREPLY_TO_INCOMING_PINGS ) || ipconfigIS_ENABLED( ipconfigSUPPORT_OUTGOING_PINGS )
                        ICMPPacket_t * const pxICMPPacket = ( ICMPPacket_t * const ) pxDescriptor->pucEthernetBuffer;
                        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
                            pxICMPPacket->xICMPHeader.usChecksum = 0U;
                        #endif
                        ( void ) pxICMPPacket;
                    #else
                        FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Unsupported ICMP\n" ) );
                    #endif
                }
            #else /* if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) */
                FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Unsupported IPv4\n" ) );
            #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) */
        }

        ETH_BufferTypeDef xTxBuffer =
        {
            .buffer = pxDescriptor->pucEthernetBuffer,
            .len    = pxDescriptor->xDataLength,
            .next   = NULL
        };

        UBaseType_t uxTxDescCount = 1U;
        TxPacketMeta_t * pxTxMeta = NULL;
        xTxConfig.TxBuffer = &xTxBuffer;
        xTxConfig.Length = xTxBuffer.len;

        #if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_TCP_SEGMENTATION ) && ipconfigIS_ENABLED( ipconfigUSE_TCP ) && ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
            if( prvSetTCPSegmentationConfig( pxDescriptor, xTxBuffer.len, &xTxConfig ) != pdFALSE )
            {
                /* TSO uses one context descriptor in addition to the data descriptor. */
                uxTxDescCount++;
            }
        #endif

        UBaseType_t uxTaken = 0U;

        for( ; uxTaken < uxTxDescCount; uxTaken++ )
        {
            if( xSemaphoreTake( xTxDescSem, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) ) == pdFALSE )
            {
                break;
            }
        }

        if( uxTaken != uxTxDescCount )
        {
            while( uxTaken-- > 0U )
            {
                ( void ) xSemaphoreGive( xTxDescSem );
            }

            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: No Descriptors Available\n" ) );
            break;
        }

        if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Process Busy\n" ) );
            for( uxTaken = 0U; uxTaken < uxTxDescCount; uxTaken++ )
            {
                ( void ) xSemaphoreGive( xTxDescSem );
            }
            break;
        }

        pxTxMeta = prvAllocateTxPacketMeta( pxDescriptor, uxTxDescCount );

        if( pxTxMeta == NULL )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Tx metadata exhausted\n" ) );
            ( void ) xSemaphoreGive( xTxMutex );
            for( uxTaken = 0U; uxTaken < uxTxDescCount; uxTaken++ )
            {
                ( void ) xSemaphoreGive( xTxDescSem );
            }
            break;
        }

        xTxConfig.pData = pxTxMeta;

        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_MAINTENANCE != 0 )
            {
                const uintptr_t uxDataStart = ( uintptr_t ) xTxBuffer.buffer;
                const uintptr_t uxLineStart = uxDataStart & ~niEMAC_DATA_ALIGNMENT_MASK;
                const ptrdiff_t uxDataOffset = uxDataStart - uxLineStart;
                const size_t uxLength = xTxBuffer.len + uxDataOffset;
                SCB_CleanDCache_by_Addr( ( uint32_t * ) uxLineStart, uxLength );
            }
        #endif

        if( HAL_ETH_Transmit_IT( pxEthHandle, &xTxConfig ) == HAL_OK )
        {
            /* Released later in deferred task by calling HAL_ETH_ReleaseTxPacket */
            xReleaseAfterSend = pdFALSE;
            xResult = pdPASS;
        }
        else
        {
            prvReleaseTxPacketMeta( pxTxMeta );
            for( uxTaken = 0U; uxTaken < uxTxDescCount; uxTaken++ )
            {
                ( void ) xSemaphoreGive( xTxDescSem );
            }
            configASSERT( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED );
            /* Should be impossible if semaphores are correctly implemented */
            configASSERT( ( HAL_ETH_GetError( pxEthHandle ) & HAL_ETH_ERROR_BUSY ) == 0 );
        }

        ( void ) xSemaphoreGive( xTxMutex );
    } while( pdFALSE );

    if( xReleaseAfterSend == pdTRUE )
    {
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvAddAllowedMACAddress( NetworkInterface_t * pxInterface,
                                     const uint8_t * pucMacAddress )
{
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    /* Keep exact address/hash programming to avoid widening destination filtering. */
    BaseType_t xResult = prvAddDestMACAddrMatch( pxEthHandle->Instance, pucMacAddress );

    if( xResult == pdFALSE )
    {
        const uint8_t ucHashIndex = prvGetMacHashIndex( pucMacAddress );

        xResult = prvSetNewDestMACAddrMatch( pxEthHandle->Instance, ucHashIndex, pucMacAddress );

        if( xResult == pdFALSE )
        {
            prvAddDestMACAddrHash( pxEthHandle, ucHashIndex );
        }
    }
}

/*---------------------------------------------------------------------------*/

static void prvRemoveAllowedMACAddress( NetworkInterface_t * pxInterface,
                                        const uint8_t * pucMacAddress )
{
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

