FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    const BaseType_t xResult = prvRemoveDestMACAddrMatch( pxEthHandle->Instance, pucMacAddress );

    if( xResult == pdFALSE )
    {
        prvRemoveDestMACAddrHash( pxEthHandle, pucMacAddress );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Task                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle,
                                            NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;
    UBaseType_t uxCount = 0;

    #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;

    if( ( xMacInitStatus == eMacInitComplete ) && ( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED ) )
    {
        while( HAL_ETH_ReadData( pxEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK )
        {
            if( pxCurDescriptor == NULL )
            {
                /* Buffer was dropped, ignore packet */
                xDropCurrentRxFrame = pdFALSE;
                continue;
            }

            if( xDropCurrentRxFrame != pdFALSE )
            {
                xDropCurrentRxFrame = pdFALSE;
                prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
                continue;
            }

            ++uxCount;

            if( ( pxCurDescriptor->xDataLength == 0U ) ||
                ( pxCurDescriptor->xDataLength > niEMAC_DATA_BUFFER_SIZE ) )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInput: Invalid packet length\n" ) );
                prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
                continue;
            }

            if( prvValidateFrame( pxEthHandle, pxCurDescriptor ) == pdFALSE )
            {
                prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
                continue;
            }

            pxCurDescriptor->pxInterface = pxInterface;
            pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
            #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
                pxCurDescriptor->pxNextBuffer = NULL;

                if( pxStartDescriptor == NULL )
                {
                    pxStartDescriptor = pxCurDescriptor;
                }
                else if( pxEndDescriptor != NULL )
                {
                    pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
                }

                pxEndDescriptor = pxCurDescriptor;
            #else /* if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) */
                prvSendRxEvent( pxCurDescriptor );
            #endif /* if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) */
        }
    }

    if( uxCount > 0 )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            if( pxStartDescriptor != NULL )
            {
                prvSendRxEvent( pxStartDescriptor );
            }
        #endif
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static portTASK_FUNCTION( prvEMACHandlerTask, pvParameters )
{
    NetworkInterface_t * pxInterface = ( NetworkInterface_t * ) pvParameters;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    EthernetPhy_t * pxPhyObject = &xPhyObject;

    iptraceEMAC_TASK_STARTING();

    for( ; ; )
    {
        BaseType_t xResult = pdFALSE;
        uint32_t ulISREvents = 0U;

        if( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( niEMAC_TASK_MAX_BLOCK_TIME_MS ) ) == pdTRUE )
        {
            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                prvReleaseTxPacket( pxEthHandle );
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                prvReleaseTxPacket( pxEthHandle );
            }

            if( ( ulISREvents & eMacEventErrDma ) != 0 )
            {
                const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );
                FreeRTOS_debug_printf( ( "prvEMACHandlerTask: DMA error event\n" ) );

                if( ( ( ulDmaError & ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0U ) &&
                    ( ( ulISREvents & eMacEventErrTx ) == 0U ) )
                {
                    prvReleaseTxPacket( pxEthHandle );
                }

                if( ( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0U ) &&
                    ( ( ulISREvents & eMacEventErrRx ) == 0U ) )
                {
                    xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
                }

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    ulISREvents |= eMacEventErrEth;
                }
            }

            if( ( ulISREvents & eMacEventErrMac ) != 0 )
            {
                FreeRTOS_debug_printf( ( "prvEMACHandlerTask: MAC error event\n" ) );

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    ulISREvents |= eMacEventErrEth;
                }
            }

            if( ( ulISREvents & eMacEventErrEth ) != 0 )
            {
                configASSERT( ( HAL_ETH_GetError( pxEthHandle ) & HAL_ETH_ERROR_PARAM ) == 0 );

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    if( prvRecoverFromCriticalError( pxEthHandle, pxPhyObject, pxInterface ) != pdFALSE )
                    {
                        if( HAL_ETH_Start_IT( pxEthHandle ) == HAL_OK )
                        {
                            xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
                        }
                        else
                        {
                            FreeRTOS_debug_printf( ( "prvEMACHandlerTask: HAL_ETH_Start_IT failed after recovery\n" ) );
                        }
                    }
                }
            }

