FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
        }

        if( xPhyCheckLinkStatus( pxPhyObject, xResult ) != pdFALSE )
        {
            if( prvGetPhyLinkStatus( pxInterface ) != pdFALSE )
            {
                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    if( prvRecoverFromCriticalError( pxEthHandle, pxPhyObject, pxInterface ) == pdFALSE )
                    {
                        FreeRTOS_debug_printf( ( "prvEMACHandlerTask: recovery failed while link-up\n" ) );
                    }
                }

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_READY )
                {
                    /* Link was down or critical error occurred */
                    if( prvMacUpdateConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
                    {
                        #if defined( niEMAC_STM32HX )
                            prvInitPacketFilter( pxEthHandle, pxInterface );
                            #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) && ipconfigIS_ENABLED( niEMAC_USE_ARP_OFFLOAD )
                                prvConfigureARPOffload( pxEthHandle, pxInterface );
                            #endif
                        #endif

                        if( HAL_ETH_Start_IT( pxEthHandle ) != HAL_OK )
                        {
                            FreeRTOS_debug_printf( ( "prvEMACHandlerTask: HAL_ETH_Start_IT failed on link-up\n" ) );
                        }
                    }
                }
            }
            else
            {
                ( void ) HAL_ETH_Stop_IT( pxEthHandle );
                prvReleaseTxPacket( pxEthHandle );
                #if ( ipconfigIS_ENABLED( ipconfigSUPPORT_NETWORK_DOWN_EVENT ) )
                    FreeRTOS_NetworkDown( pxInterface );
                #endif
            }
        }

        #if defined( niEMAC_STM32HX )
            if( xMacInitStatus == eMacInitComplete )
            {
                const HAL_ETH_StateTypeDef xEthState = HAL_ETH_GetState( pxEthHandle );

                if( ( xEthState == HAL_ETH_STATE_READY ) || ( xEthState == HAL_ETH_STATE_STARTED ) )
                {
                    const TickType_t xNow = xTaskGetTickCount();

                    if( ( xNow - xLastFilterRefreshTick ) >= pdMS_TO_TICKS( niEMAC_FILTER_REFRESH_TIME_MS ) )
                    {
                        prvInitPacketFilter( pxEthHandle, pxInterface );
                        #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) && ipconfigIS_ENABLED( niEMAC_USE_ARP_OFFLOAD )
                            prvConfigureARPOffload( pxEthHandle, pxInterface );
                        #endif
                        xLastFilterRefreshTick = xNow;
                    }
                }
            }
        #endif
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvEMACTaskStart( NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    if( xTxMutex == NULL )
    {
        #if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION )
            static StaticSemaphore_t xTxMutexBuf;
            xTxMutex = xSemaphoreCreateMutexStatic( &xTxMutexBuf );
        #else
            xTxMutex = xSemaphoreCreateMutex();
        #endif
        configASSERT( xTxMutex != NULL );
        #if ( configQUEUE_REGISTRY_SIZE > 0 )
            vQueueAddToRegistry( xTxMutex, niEMAC_TX_MUTEX_NAME );
        #endif
    }

    if( xTxDescSem == NULL )
    {
        #if ( ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) )
            static StaticSemaphore_t xTxDescSemBuf;
            xTxDescSem = xSemaphoreCreateCountingStatic(
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                &xTxDescSemBuf
                );
        #else
            xTxDescSem = xSemaphoreCreateCounting(
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                ( UBaseType_t ) ETH_TX_DESC_CNT
                );
        #endif /* if ( ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) ) */
        configASSERT( xTxDescSem != NULL );
        #if ( configQUEUE_REGISTRY_SIZE > 0 )
            vQueueAddToRegistry( xTxDescSem, niEMAC_TX_DESC_SEM_NAME );
        #endif
    }

    if( ( xEMACTaskHandle == NULL ) && ( xTxMutex != NULL ) && ( xTxDescSem != NULL ) )
    {
        #if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION )
            static StackType_t uxEMACTaskStack[ niEMAC_TASK_STACK_SIZE ];
            static StaticTask_t xEMACTaskTCB;
            xEMACTaskHandle = xTaskCreateStatic(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxInterface,
                niEMAC_TASK_PRIORITY,
                uxEMACTaskStack,
                &xEMACTaskTCB
                );
        #else /* if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) */
            ( void ) xTaskCreate(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxInterface,
                niEMAC_TASK_PRIORITY,
                &xEMACTaskHandle
                );
        #endif /* if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) */
    }

    if( xEMACTaskHandle != NULL )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                               EMAC Init                                   */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvApplyMACDMAConfig( ETH_HandleTypeDef * pxEthHandle,
                                        const EthernetPhy_t * pxPhyObject )
{
    ETH_MACConfigTypeDef xMACConfig;

    if( HAL_ETH_GetMACConfig( pxEthHandle, &xMACConfig ) != HAL_OK )
    {
        return pdFALSE;
    }

    if( pxPhyObject != NULL )
    {
        xMACConfig.DuplexMode = ( pxPhyObject->xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
        xMACConfig.Speed = ( pxPhyObject->xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
    }

