FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    xMACConfig.ChecksumOffload = ( FunctionalState ) ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM );
    xMACConfig.CRCStripTypePacket = DISABLE;
    xMACConfig.AutomaticPadCRCStrip = ENABLE;
    xMACConfig.RetryTransmission = ENABLE;

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) != HAL_OK )
    {
        return pdFALSE;
    }

    ETH_DMAConfigTypeDef xDMAConfig;

    if( HAL_ETH_GetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
    {
        return pdFALSE;
    }

    #if defined( niEMAC_STM32FX )
        xDMAConfig.EnhancedDescriptorFormat = ( FunctionalState ) ( ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM ) || ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM ) );
    #elif defined( niEMAC_STM32HX )
        xDMAConfig.SecondPacketOperate = ENABLE;
        #if ipconfigIS_ENABLED( niEMAC_USE_TCP_SEGMENTATION ) && ipconfigIS_ENABLED( ipconfigUSE_TCP )
            xDMAConfig.TCPSegmentation = ENABLE;
            xDMAConfig.MaximumSegmentSize = ( uint32_t ) niEMAC_TCP_SEGMENTATION_MSS;
        #else
            xDMAConfig.TCPSegmentation = DISABLE;
        #endif
    #endif

    if( HAL_ETH_SetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
    {
        return pdFALSE;
    }

    return pdTRUE;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvRecoverFromCriticalError( ETH_HandleTypeDef * pxEthHandle,
                                               const EthernetPhy_t * pxPhyObject,
                                               NetworkInterface_t * pxInterface )
{
    xDropCurrentRxFrame = pdFALSE;
    xLastFilterRefreshTick = 0U;

    for( UBaseType_t uxIndex = 0U; uxIndex < ( UBaseType_t ) ETH_TX_DESC_CNT; uxIndex++ )
    {
        if( xTxPacketMeta[ uxIndex ].xInUse != pdFALSE )
        {
            if( xTxPacketMeta[ uxIndex ].pxDescriptor != NULL )
            {
                vReleaseNetworkBufferAndDescriptor( xTxPacketMeta[ uxIndex ].pxDescriptor );
            }

            xTxPacketMeta[ uxIndex ].pxDescriptor = NULL;
            xTxPacketMeta[ uxIndex ].uxDescCount = 0U;
            xTxPacketMeta[ uxIndex ].xInUse = pdFALSE;
        }
    }

    if( xTxDescSem != NULL )
    {
        UBaseType_t uxSemCount = uxSemaphoreGetCount( xTxDescSem );

        while( uxSemCount < ( UBaseType_t ) ETH_TX_DESC_CNT )
        {
            if( xSemaphoreGive( xTxDescSem ) == pdFALSE )
            {
                break;
            }

            uxSemCount++;
        }
    }

    for( uint32_t i = 0U; i < ( uint32_t ) ETH_TX_DESC_CNT; i++ )
    {
        pxEthHandle->TxDescList.PacketAddress[ i ] = NULL;
    }

    pxEthHandle->TxDescList.BuffersInUse = 0U;
    pxEthHandle->TxDescList.releaseIndex = 0U;
    pxEthHandle->TxDescList.CurrentPacketAddress = NULL;

    if( HAL_ETH_Init( pxEthHandle ) != HAL_OK )
    {
        return pdFALSE;
    }

    if( prvApplyMACDMAConfig( pxEthHandle, pxPhyObject ) == pdFALSE )
    {
        return pdFALSE;
    }

    prvInitMacAddresses( pxEthHandle, pxInterface );

    #if defined( niEMAC_STM32HX )
        prvInitPacketFilter( pxEthHandle, pxInterface );
        #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) && ipconfigIS_ENABLED( niEMAC_USE_ARP_OFFLOAD )
            prvConfigureARPOffload( pxEthHandle, pxInterface );
        #endif
    #endif

    return pdTRUE;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvEthConfigInit( ETH_HandleTypeDef * pxEthHandle,
                                    NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    pxEthHandle->Instance = ETH;
    pxEthHandle->Init.MediaInterface = ipconfigIS_ENABLED( niEMAC_USE_RMII ) ? HAL_ETH_RMII_MODE : HAL_ETH_MII_MODE;
    pxEthHandle->Init.RxBuffLen = niEMAC_DATA_BUFFER_SIZE;
    configASSERT( ipTOTAL_ETHERNET_FRAME_SIZE <= ETH_MAX_PACKET_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen >= ipTOTAL_ETHERNET_FRAME_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen % 4U == 0 );
    static ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );
    static ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );
    pxEthHandle->Init.TxDesc = xDMADescTx;
    pxEthHandle->Init.RxDesc = xDMADescRx;
    ( void ) memset( &xDMADescTx, 0, sizeof( xDMADescTx ) );
    ( void ) memset( &xDMADescRx, 0, sizeof( xDMADescRx ) );

    const NetworkEndPoint_t * const pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );

    if( pxEndPoint != NULL )
    {
        pxEthHandle->Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;

        if( HAL_ETH_Init( pxEthHandle ) == HAL_OK )
        {
            do
            {
                #if defined( niEMAC_STM32FX )
                    /* This function doesn't get called in Fxx driver */
                    HAL_ETH_SetMDIOClockRange( pxEthHandle );
                #endif

                if( prvApplyMACDMAConfig( pxEthHandle, NULL ) == pdFALSE )
                {
                    break;
                }

                #if defined( niEMAC_STM32HX )
                    prvInitPacketFilter( pxEthHandle, pxInterface );
                    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) && ipconfigIS_ENABLED( niEMAC_USE_ARP_OFFLOAD )
                        prvConfigureARPOffload( pxEthHandle, pxInterface );
                    #endif
                #endif

                prvInitMacAddresses( pxEthHandle, pxInterface );

                xResult = pdTRUE;
            } while( pdFALSE );
        }
    }

    if( xResult == pdTRUE )
    {
        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_ENABLED )
            {
                #ifdef niEMAC_MPU
                    configASSERT( niEMAC_MPU_ENABLED != 0 );
                #else
                    configASSERT( pdFALSE );
                #endif
            }
        #endif

