FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
                                    uxIPv6EndPoints++;

                                    if( uxIPv6EndPoints > 1U )
                                    {
                                        break;
                                    }
                                }
                            }
                        }

                        if( uxIPv6EndPoints == 1U )
                        {
                            xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                            xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                            xL3FilterConfig.Ip6Addr[ 0 ] = ulIPv6Address[ 0 ];
                            xL3FilterConfig.Ip6Addr[ 1 ] = ulIPv6Address[ 1 ];
                            xL3FilterConfig.Ip6Addr[ 2 ] = ulIPv6Address[ 2 ];
                            xL3FilterConfig.Ip6Addr[ 3 ] = ulIPv6Address[ 3 ];
                        }
                        else
                        {
                            xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_MATCH_DISABLE;
                            xL3FilterConfig.DestAddrHigherBitsMatch = 0U;
                            xL3FilterConfig.Ip6Addr[ 0 ] = 0U;
                            xL3FilterConfig.Ip6Addr[ 1 ] = 0U;
                            xL3FilterConfig.Ip6Addr[ 2 ] = 0U;
                            xL3FilterConfig.Ip6Addr[ 3 ] = 0U;
                        }
                    }
                    #else
                        /* Block IPv6 if it is disabled. */
                        xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.SrcAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.Ip6Addr[ 0 ] = 0xFFFFFFFFU;
                        xL3FilterConfig.Ip6Addr[ 1 ] = 0xFFFFFFFFU;
                        xL3FilterConfig.Ip6Addr[ 2 ] = 0xFFFFFFFFU;
                        xL3FilterConfig.Ip6Addr[ 3 ] = 0xFFFFFFFFU;
                    #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) */

                    ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                }
                #endif /* if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) */

                {
                    ETH_L4FilterConfigTypeDef xL4FilterConfig;

                    ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig );
                    xL4FilterConfig.Protocol = ETH_L4_UDP_MATCH;
                    xL4FilterConfig.SrcPortFilterMatch = ETH_L4_SRC_PORT_MATCH_DISABLE;
                    xL4FilterConfig.DestPortFilterMatch = ETH_L4_DEST_PORT_MATCH_DISABLE;
                    xL4FilterConfig.SourcePort = 0U;
                    xL4FilterConfig.DestinationPort = 0U;
                    ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig );

                    #if ipconfigIS_DISABLED( ipconfigUSE_TCP )
                        /* Block TCP if it is disabled */
                        ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfig );
                        xL4FilterConfig.Protocol = ETH_L4_TCP_MATCH;
                        xL4FilterConfig.SrcPortFilterMatch = ETH_L4_SRC_PORT_PERFECT_MATCH_ENABLE;
                        xL4FilterConfig.DestPortFilterMatch = ETH_L4_DEST_PORT_PERFECT_MATCH_ENABLE;
                        xL4FilterConfig.SourcePort = 0xFFFFU;
                        xL4FilterConfig.DestinationPort = 0xFFFFU;
                        ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfig );
                    #endif
                }

                HAL_ETHEx_EnableL3L4Filtering( pxEthHandle );
            }
        }
        #endif /* if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM ) */
    }

    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) && ipconfigIS_ENABLED( niEMAC_USE_ARP_OFFLOAD )

        static void prvConfigureARPOffload( ETH_HandleTypeDef * pxEthHandle,
                                            const NetworkInterface_t * const pxInterface )
        {
            uint32_t ulARPOffloadAddress = 0U;
            UBaseType_t uxIPv4EndpointCount = 0U;
            NetworkEndPoint_t * pxEndPoint;

            for( pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
                 pxEndPoint != NULL;
                 pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
            {
                if( ENDPOINT_IS_IPv4( pxEndPoint ) &&
                    ( pxEndPoint->ipv4_settings.ulIPAddress != 0U ) )
                {
                    ulARPOffloadAddress = pxEndPoint->ipv4_settings.ulIPAddress;
                    uxIPv4EndpointCount++;

                    if( uxIPv4EndpointCount > 1U )
                    {
                        ulARPOffloadAddress = 0U;
                        break;
                    }
                }
            }

            HAL_ETHEx_DisableARPOffload( pxEthHandle );

            if( ulARPOffloadAddress != 0U )
            {
                HAL_ETHEx_SetARPAddressMatch( pxEthHandle, ulARPOffloadAddress );
                HAL_ETHEx_EnableARPOffload( pxEthHandle );
            }
        }

    #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) && ipconfigIS_ENABLED( niEMAC_USE_ARP_OFFLOAD ) */

#endif /* ifdef niEMAC_STM32HX */

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyInit( EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFAIL;

    vPhyInitialise( pxPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );

    if( xPhyDiscover( pxPhyObject ) != 0 )
    {
        xResult = pdPASS;
    }

    return xResult;
}

