FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
static void prvReleaseTxPacketMeta( TxPacketMeta_t * pxTxMeta )
{
    if( pxTxMeta == NULL )
    {
        return;
    }

    taskENTER_CRITICAL();
    {
        pxTxMeta->pxDescriptor = NULL;
        pxTxMeta->uxDescCount = 0U;
        pxTxMeta->xInUse = pdFALSE;
    }
    taskEXIT_CRITICAL();
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvGetTxPacketMeta( TxPacketMeta_t * pxTxMeta,
                                      NetworkBufferDescriptor_t ** ppxDescriptor,
                                      UBaseType_t * puxDescCount )
{
    if( ( pxTxMeta == NULL ) || ( ppxDescriptor == NULL ) || ( puxDescCount == NULL ) )
    {
        return pdFALSE;
    }

    const uintptr_t uxMetaPtr = ( uintptr_t ) pxTxMeta;
    const uintptr_t uxStart = ( uintptr_t ) &( xTxPacketMeta[ 0 ] );
    const uintptr_t uxEnd = ( uintptr_t ) &( xTxPacketMeta[ ETH_TX_DESC_CNT ] );

    if( ( uxMetaPtr < uxStart ) || ( uxMetaPtr >= uxEnd ) )
    {
        return pdFALSE;
    }

    if( ( ( uxMetaPtr - uxStart ) % sizeof( TxPacketMeta_t ) ) != 0U )
    {
        return pdFALSE;
    }

    BaseType_t xResult = pdFALSE;
    taskENTER_CRITICAL();

    if( pxTxMeta->xInUse != pdFALSE )
    {
        *ppxDescriptor = pxTxMeta->pxDescriptor;
        *puxDescCount = pxTxMeta->uxDescCount;
        pxTxMeta->pxDescriptor = NULL;
        pxTxMeta->uxDescCount = 0U;
        pxTxMeta->xInUse = pdFALSE;
        xResult = pdTRUE;
    }

    taskEXIT_CRITICAL();

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseTxPacket( ETH_HandleTypeDef * pxEthHandle )
{
    if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
    {
        ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
        ( void ) xSemaphoreGive( xTxMutex );
    }
    else
    {
        FreeRTOS_debug_printf( ( "prvReleaseTxPacket: Failed\n" ) );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle,
                                      EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED )
    {
        ( void ) HAL_ETH_Stop_IT( pxEthHandle );
    }

    #if ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION )
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #else
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #endif

    if( prvApplyMACDMAConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;

    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    }
}

/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent =
    {
        .eEventType = eNetworkRxEvent,
        .pvData     = ( void * ) pxDescriptor
    };

    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor,
                                   uint16_t usLength )
{
    BaseType_t xResult = pdFALSE;

    do
    {
        if( pxDescriptor == NULL )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Null Descriptor\n" ) );
            break;
        }

        if( usLength > pxDescriptor->xDataLength )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet size overflow\n" ) );
            break;
        }

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
            if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
                break;
            }
        #endif

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
            if( prvPassesPacketFilter( pxDescriptor->pucEthernetBuffer ) == pdFALSE )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet discarded\n" ) );
                break;
            }
        #endif

        xResult = pdTRUE;
    } while( pdFALSE );

    return xResult;
}

/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )

static BaseType_t prvPassesPacketFilter( const uint8_t * const pucEthernetBuffer )
{
    const EthernetHeader_t * const pxEthernetHeader = ( const EthernetHeader_t * const ) pucEthernetBuffer;

    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
        if( pxEthernetHeader->usFrameType == ipARP_FRAME_TYPE )
        {
            return pdTRUE;
        }

        if( pxEthernetHeader->usFrameType == ipIPv4_FRAME_TYPE )
        {
            const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pucEthernetBuffer;
            const IPHeader_t * const pxIPHeader = &( pxIPPacket->xIPHeader );

