FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            if( ( pxIPHeader->ucVersionHeaderLength < ipIPV4_VERSION_HEADER_LENGTH_MIN ) ||
                ( pxIPHeader->ucVersionHeaderLength > ipIPV4_VERSION_HEADER_LENGTH_MAX ) )
            {
                return pdFALSE;
            }

            if( ( ( pxIPHeader->usFragmentOffset & ipFRAGMENT_OFFSET_BIT_MASK ) != 0U ) ||
                ( ( pxIPHeader->usFragmentOffset & ipFRAGMENT_FLAGS_MORE_FRAGMENTS ) != 0U ) )
            {
                return pdFALSE;
            }

            if( xBadIPv4Loopback( pxIPHeader ) == pdTRUE )
            {
                return pdFALSE;
            }

            if( memcmp( xBroadcastMACAddress.ucBytes,
                        pxEthernetHeader->xSourceAddress.ucBytes,
                        sizeof( MACAddress_t ) ) == 0 )
            {
                return pdFALSE;
            }

            if( xIsIPv4Multicast( pxIPHeader->ulSourceIPAddress ) == pdTRUE )
            {
                return pdFALSE;
            }

            return pdTRUE;
        }
    #endif /* ipconfigUSE_IPv4 */

    #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
        if( pxEthernetHeader->usFrameType == ipIPv6_FRAME_TYPE )
        {
            const IPPacket_IPv6_t * const pxIPv6Packet = ( const IPPacket_IPv6_t * const ) pucEthernetBuffer;
            const IPHeader_IPv6_t * const pxIPv6Header = &( pxIPv6Packet->xIPHeader );

            if( ( ( pxIPv6Header->ucVersionTrafficClass & ( uint8_t ) 0xF0U ) >> 4 ) != 6U )
            {
                return pdFALSE;
            }

            if( ( memcmp( pxIPv6Header->xDestinationAddress.ucBytes, FreeRTOS_in6addr_any.ucBytes, sizeof( IPv6_Address_t ) ) == 0 ) ||
                ( memcmp( pxIPv6Header->xSourceAddress.ucBytes, FreeRTOS_in6addr_any.ucBytes, sizeof( IPv6_Address_t ) ) == 0 ) )
            {
                return pdFALSE;
            }

            if( ( xIsIPv6Loopback( &pxIPv6Header->xSourceAddress ) == pdTRUE ) ||
                ( xIsIPv6Loopback( &pxIPv6Header->xDestinationAddress ) == pdTRUE ) )
            {
                return pdFALSE;
            }

            return pdTRUE;
        }
    #endif /* ipconfigUSE_IPv6 */

    return pdTRUE;
}

#endif /* ipconfigETHERNET_DRIVER_FILTERS_PACKETS */

/*---------------------------------------------------------------------------*/

static BaseType_t prvValidateFrame( ETH_HandleTypeDef * pxEthHandle,
                                    const NetworkBufferDescriptor_t * const pxDescriptor )
{
    BaseType_t xResult = pdTRUE;

    uint32_t ulErrorCode = 0;

    if( HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode ) != HAL_OK )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvValidateFrame: Failed to read Rx Data Error\n" ) );
        xResult = pdFALSE;
    }
    else if( ulErrorCode != 0 )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvValidateFrame: Rx Data Error\n" ) );
        xResult = pdFALSE;
    }

    ( void ) pxDescriptor;

    return xResult;
}

/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              IRQ Handlers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void ETH_IRQHandler( void )
{
    traceISR_ENTER();

    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    xSwitchRequired = pdFALSE;
    if( pxEthHandle->Instance != NULL )
    {
        HAL_ETH_IRQHandler( pxEthHandle );
    }

    portYIELD_FROM_ISR( xSwitchRequired );
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    eMAC_IF_EVENT eErrorEvents = eMacEventNone;
    const uint32_t ulEthError = HAL_ETH_GetError( pxEthHandle );

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
    {
        /* Fatal bus error occurred */
        eErrorEvents |= eMacEventErrEth;
    }

    if( ( ulEthError & HAL_ETH_ERROR_DMA ) != 0U )
    {
        eErrorEvents |= eMacEventErrDma;
        const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );

        if( ( ulDmaError & ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrTx;
        }

        if( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrRx;
        }
    }

    if( ( ulEthError & HAL_ETH_ERROR_MAC ) != 0U )
    {
        eErrorEvents |= eMacEventErrMac;
    }

    if( ( xEMACTaskHandle != NULL ) && ( eErrorEvents != eMacEventNone ) )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eErrorEvents, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_RxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostRXDescsUsed = 0U;

    const size_t uxRxUsed = pxEthHandle->RxDescList.RxDescCnt;

    if( uxMostRXDescsUsed < uxRxUsed )
    {
        uxMostRXDescsUsed = uxRxUsed;
    }

    iptraceNETWORK_INTERFACE_RECEIVE();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventRx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_TxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostTXDescsUsed = 0U;

    const size_t uxTxUsed = HAL_ETH_GetTxBuffersNumber( pxEthHandle );

    if( uxMostTXDescsUsed < uxTxUsed )
    {
        uxMostTXDescsUsed = uxTxUsed;
    }

