FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    iptraceNETWORK_INTERFACE_TRANSMIT();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventTx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            HAL Tx/Rx Callbacks                            */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void HAL_ETH_RxAllocateCallback( uint8_t ** ppucBuff )
{
    if( ppucBuff == NULL )
    {
        return;
    }

    const NetworkBufferDescriptor_t * pxBufferDescriptor = pxGetNetworkBufferWithDescriptor( niEMAC_DATA_BUFFER_SIZE, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) );

    if( pxBufferDescriptor != NULL )
    {
        *ppucBuff = pxBufferDescriptor->pucEthernetBuffer;
    }
    else
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxAllocateCallback: failed\n" ) );
        *ppucBuff = NULL;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_RxLinkCallback( void ** ppvStart,
                             void ** ppvEnd,
                             uint8_t * pucBuff,
                             uint16_t usLength )
{
    if( ( ppvStart == NULL ) || ( ppvEnd == NULL ) )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid callback context\n" ) );
        if( pucBuff != NULL )
        {
            NetworkBufferDescriptor_t * const pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucBuff );

            if( pxCurDescriptor != NULL )
            {
                prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
            }
        }
        return;
    }

    if( pucBuff == NULL )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: NULL buffer pointer\n" ) );
        return;
    }

    NetworkBufferDescriptor_t ** const ppxStartDescriptor = ( NetworkBufferDescriptor_t ** ) ppvStart;
    NetworkBufferDescriptor_t ** const ppxEndDescriptor = ( NetworkBufferDescriptor_t ** ) ppvEnd;
    NetworkBufferDescriptor_t * const pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucBuff );

    if( pxCurDescriptor == NULL )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid buffer descriptor\n" ) );
        return;
    }

    #ifdef niEMAC_CACHEABLE
        if( niEMAC_CACHE_MAINTENANCE != 0 )
        {
            const uintptr_t uxDataStart = ( uintptr_t ) pucBuff;
            const uintptr_t uxLineStart = uxDataStart & ~niEMAC_DATA_ALIGNMENT_MASK;
            const size_t uxDataOffset = ( size_t ) ( uxDataStart - uxLineStart );
            const size_t uxLength = ( ( ( size_t ) usLength + uxDataOffset + niEMAC_DATA_ALIGNMENT_MASK ) & ~niEMAC_DATA_ALIGNMENT_MASK );
            SCB_InvalidateDCache_by_Addr( ( uint32_t * ) uxLineStart, uxLength );
        }
    #endif

    if( xDropCurrentRxFrame != pdFALSE )
    {
        if( *ppxStartDescriptor != NULL )
        {
            NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;
            *ppxStartDescriptor = NULL;
            *ppxEndDescriptor = NULL;
            prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        }

        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        return;
    }

    if( *ppxStartDescriptor == NULL )
    {
        if( prvAcceptPacket( pxCurDescriptor, usLength ) == pdTRUE )
        {
            pxCurDescriptor->xDataLength = usLength;
            #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
                pxCurDescriptor->pxNextBuffer = NULL;
            #endif

            *ppxStartDescriptor = pxCurDescriptor;
            *ppxEndDescriptor = pxCurDescriptor;
        }
        else
        {
            FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Buffer Dropped\n" ) );
            prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        }

        return;
    }

    if( usLength == 0U )
    {
        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        return;
    }

    NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;
    const size_t uxCurrentLength = pxStartDescriptor->xDataLength;
    const size_t uxNewLength = uxCurrentLength + ( size_t ) usLength;

    if( uxNewLength > niEMAC_DATA_BUFFER_SIZE )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Multi-buffer frame overflow\n" ) );
        xDropCurrentRxFrame = pdTRUE;
        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        *ppxStartDescriptor = NULL;
        *ppxEndDescriptor = NULL;
        return;
    }

    configASSERT( niEMAC_DATA_BUFFER_SIZE <= ( niEMAC_TOTAL_BUFFER_SIZE - ipBUFFER_PADDING ) );
    ( void ) memcpy( &( pxStartDescriptor->pucEthernetBuffer[ uxCurrentLength ] ), pucBuff, usLength );
    pxStartDescriptor->xDataLength = uxNewLength;
    *ppxEndDescriptor = pxStartDescriptor;
    prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_TxFreeCallback( uint32_t * pulBuff )
{
    if( pulBuff == NULL )
    {
        return;
    }

    NetworkBufferDescriptor_t * pxNetworkBuffer = NULL;
    UBaseType_t uxDescCount = 1U;
    TxPacketMeta_t * const pxTxMeta = ( TxPacketMeta_t * ) pulBuff;

    if( prvGetTxPacketMeta( pxTxMeta, &pxNetworkBuffer, &uxDescCount ) == pdFALSE )
    {
        configASSERT( pdFALSE );
        return;
    }

    if( ( uxDescCount == 0U ) || ( uxDescCount > ( UBaseType_t ) ETH_TX_DESC_CNT ) )
    {
        configASSERT( pdFALSE );

        if( pxNetworkBuffer != NULL )
        {
            prvReleaseNetworkBufferDescriptor( pxNetworkBuffer );
        }

        return;
    }

