FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    if( pxNetworkBuffer != NULL )
    {
        prvReleaseNetworkBufferDescriptor( pxNetworkBuffer );
    }

    for( UBaseType_t uxIndex = 0U; uxIndex < uxDescCount; uxIndex++ )
    {
        if( xTxDescSem == NULL )
        {
            break;
        }

        if( xSemaphoreGive( xTxDescSem ) == pdFALSE )
        {
            break;
        }
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           Buffer Allocation                               */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

size_t uxNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    static uint8_t ucNetworkPackets[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ][ niEMAC_TOTAL_BUFFER_SIZE ] __ALIGNED( niEMAC_BUF_ALIGNMENT ) __attribute__( ( section( niEMAC_BUFFERS_SECTION ) ) );

    configASSERT( niEMAC_TOTAL_BUFFER_SIZE >= ipconfigETHERNET_MINIMUM_PACKET_BYTES );
    configASSERT( xBufferAllocFixedSize == pdTRUE );

    size_t uxIndex;

    for( uxIndex = 0; uxIndex < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; ++uxIndex )
    {
        pxNetworkBuffers[ uxIndex ].pucEthernetBuffer = &( ucNetworkPackets[ uxIndex ][ ipBUFFER_PADDING ] );
        *( ( uint32_t * ) &( ucNetworkPackets[ uxIndex ][ 0 ] ) ) = ( uint32_t ) ( &( pxNetworkBuffers[ uxIndex ] ) );
    }

    return (niEMAC_TOTAL_BUFFER_SIZE - ipBUFFER_PADDING);
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Network Interface Definition                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex,
                                                      NetworkInterface_t * pxInterface )
{
    static char pcName[ 17 ];

    if( pxInterface == NULL )
    {
        FreeRTOS_debug_printf( ( "pxSTM32_FillInterfaceDescriptor: NULL pxInterface\n" ) );
        return NULL;
    }

    if( xEMACIndex != 0 )
    {
        FreeRTOS_debug_printf( ( "pxSTM32_FillInterfaceDescriptor: Invalid xEMACIndex\n" ) );
        return NULL;
    }

    ( void ) snprintf( pcName, sizeof( pcName ), "eth%u", ( unsigned ) xEMACIndex );

    ( void ) memset( pxInterface, '\0', sizeof( *pxInterface ) );
    pxInterface->pcName = pcName;
    /* Store index for API compatibility; current implementation uses static context. */
    pxInterface->pvArgument = ( void * ) xEMACIndex;
    pxInterface->pfInitialise = prvNetworkInterfaceInitialise;
    pxInterface->pfOutput = prvNetworkInterfaceOutput;
    pxInterface->pfGetPhyLinkStatus = prvGetPhyLinkStatus;

    pxInterface->pfAddAllowedMAC = prvAddAllowedMACAddress;
    pxInterface->pfRemoveAllowedMAC = prvRemoveAllowedMACAddress;

    return FreeRTOS_AddNetworkInterface( pxInterface );
}

/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( ipconfigIPv4_BACKWARD_COMPATIBLE )

/* Do not call the following function directly. It is there for downward compatibility.
 * The function FreeRTOS_IPInit() will call it to initialice the interface and end-point
 * objects.  See the description in FreeRTOS_Routing.h. */
    NetworkInterface_t * pxFillInterfaceDescriptor( BaseType_t xEMACIndex,
                                                    NetworkInterface_t * pxInterface )
    {
        return pxSTM32_FillInterfaceDescriptor( xEMACIndex, pxInterface );
    }

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                          Sample HAL User Functions                        */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if 0

/**
 * @brief  Initializes the ETH MSP.
 * @param  heth: ETH handle
 * @retval None
 */
    void HAL_ETH_MspInit( ETH_HandleTypeDef * pxEthHandle )
    {
        if( pxEthHandle->Instance == ETH )
        {
            /* Enable ETHERNET clock */
            #ifdef niEMAC_STM32FX
                __HAL_RCC_ETH_CLK_ENABLE();
            #elif defined( STM32H5 )
                __HAL_RCC_ETH_CLK_ENABLE();
                __HAL_RCC_ETHTX_CLK_ENABLE();
                __HAL_RCC_ETHRX_CLK_ENABLE();
            #elif defined( STM32H7 )
                __HAL_RCC_ETH1MAC_CLK_ENABLE();
                __HAL_RCC_ETH1TX_CLK_ENABLE();
                __HAL_RCC_ETH1RX_CLK_ENABLE();
            #endif

            /* Enable GPIOs clocks */
            __HAL_RCC_GPIOA_CLK_ENABLE();
            __HAL_RCC_GPIOB_CLK_ENABLE();
            __HAL_RCC_GPIOC_CLK_ENABLE();
            __HAL_RCC_GPIOD_CLK_ENABLE();
            __HAL_RCC_GPIOE_CLK_ENABLE();
            __HAL_RCC_GPIOF_CLK_ENABLE();
            __HAL_RCC_GPIOG_CLK_ENABLE();
            __HAL_RCC_GPIOH_CLK_ENABLE();

            /* Ethernet pins configuration ************************************************/

            /*
             *  Common Pins
             *  ETH_MDC ----------------------> ETH_MDC_Port, ETH_MDC_Pin
             *  ETH_MDIO --------------------->
             *  ETH_RXD0 --------------------->
             *  ETH_RXD1 --------------------->
             *  ETH_TX_EN -------------------->
             *  ETH_TXD0 --------------------->
             *  ETH_TXD1 --------------------->
             *
             *  RMII Specific Pins
             *  ETH_REF_CLK ------------------>
             *  ETH_CRS_DV ------------------->
             *
             *  MII Specific Pins
             *  ETH_RX_CLK ------------------->
             *  ETH_RX_ER -------------------->
             *  ETH_RX_DV -------------------->
             *  ETH_RXD2 --------------------->
             *  ETH_RXD3 --------------------->
             *  ETH_TX_CLK ------------------->
             *  ETH_TXD2 --------------------->
             *  ETH_TXD3 --------------------->
             *  ETH_CRS ---------------------->
             *  ETH_COL ---------------------->
             */

            GPIO_InitTypeDef GPIO_InitStructure = { 0 };
            GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
            GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
            GPIO_InitStructure.Pull = GPIO_NOPULL;
            GPIO_InitStructure.Alternate = GPIO_AF11_ETH;

            GPIO_InitStructure.Pin = ETH_MDC_Pin;
            GPIO_InitStructure.Speed = GPIO_SPEED_MEDIUM;
            HAL_GPIO_Init( ETH_MDC_Port, &GPIO_InitStructure );
            GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;

            GPIO_InitStructure.Pin = ETH_MDIO_Pin;
            HAL_GPIO_Init( ETH_MDIO_Port, &GPIO_InitStructure );

            GPIO_InitStructure.Pin = ETH_RXD0_Pin;
            HAL_GPIO_Init( ETH_RXD0_Port, &GPIO_InitStructure );

            GPIO_InitStructure.Pin = ETH_RXD1_Pin;
            HAL_GPIO_Init( ETH_RXD1_Port, &GPIO_InitStructure );

            GPIO_InitStructure.Pin = ETH_TX_EN_Pin;
            HAL_GPIO_Init( ETH_TX_EN_Port, &GPIO_InitStructure );

            GPIO_InitStructure.Pin = ETH_TXD0_Pin;
            HAL_GPIO_Init( ETH_TXD0_Port, &GPIO_InitStructure );

